{
  "projects": {
    "title": "Projects",
    "alt": "Projects",
    "body": "Welcome to the projects window! I am passionate about many things, and enjoy leveraging' my knowledge of both computer science and design to create projects that are functional, beautiful, and serve a particular purpose. I have decided to showcase three of my recent' projects in this portfolio. The first is my congress.gov website redesign concept. The second is my Markdown-style notes application, and the third includes various UI designs I've worked on. To enter the projects page experience, click the 🔲 icon at the top-right corner of this window. Your task will to be to swipe/scroll downwards!"
  },
  "about": {
    "title": "About Me",
    "alt": "About Me",
    "body": "This page will give you a quick introduction to who I am and what my passions are! I styled it to look like a Git repository graph. Each \"branch\" represents a certain aspect of myself. For instance, the \"Work Experience\" branch will detail information about the various jobs I've had and about the work I've done at each. Every underlined piece of text is clickable, and will popup a window with more information. To explore, click the 🔲 icon in this window to open up the page!"
  },
  "contact": {
    "title": "Contact Me",
    "alt": "Contact Me",
    "body": "This page houses all of my contact information should you want to get in touch with me! It includes various other sources if you want to see my other work, such as my design portfolio and my GitHub profile. This page highlights how my design language has shifted throughout my years designing, from creating a custom Roblox logo in 2017 in Google Drawings to performing design work to establish a brand identity for myself. To see my design language in each era, there will be a button near the top of the screen that is clickable. This will re-style the page to fit with my design language at the time. If you wish to see this, click the 🔲 icon at the top of this window!"
  },
  "empty": {
    "title": "",
    "body": ""
  },
  "project-one": {
    "title": "congress.gov Redesign",
    "alt": "Project 1",
    "body": "Taking a look at the current congress.gov website, it looks more outdated. For this personal project, I redesigned the website to modernize the look as well as to ensure greater accessibility and user-intuitiveness.\n\nFor more information about this project, click the 🔲 at the top of the window.",
    "image": "../assets/window_images/congress_website_redesign.png"
  },
  "project-two": {
    "title": "Markdown Notes Application",
    "alt": "Project 2",
    "body": "In this project, I'm creating a notes app that uses the widespread Markdown syntax to determine text style (heading, paragraph, code, etc). This project is being created with HTML/CSS/JS with Electron.\n\nFor more information about this project, click the 🔲 at the top of the window.",
    "image": "../assets/window_images/md_editor.png"
  },
  "design-portfolio": {
    "title": "Design Portfolio",
    "alt": "Portfolio",
    "body": "This section is designed to highlight my design portfolio. Throughout my life, I have worked on many designs, be it for personal or academic reasons. There are a few of these designs which I'm particularly proud of and wish to highlight. In addition, a link will be present to my Behance page, which houses these designs and more!\n\nTo check out my portfolio, click the 🔲 at the top of the window."
  }
}